In [3]:
import pandas as pd

In [4]:
df = pd.read_excel(r'C:\Users\Allen Namakula\Desktop\data science\data\dataset.xlsx')
print(df)

    S/N             student_names  age weight   height
0     1            Adokorac Nancy   20     74    177.8
1     2   Amutuhaire Faith Ahabwe   27     47   157.48
2     3     KWAGALA JOANNA VICTOR   21     54   185.42
3     4              mahoro cathy   23     30   185.42
4     5  Mbabazi Hawa Bint Edrisa   19     59   175.26
5     6       Nakanjako josephine   24     65   175.26
6     7            Nanteza Dorcus   21     69   157.48
7     8             Mbabazi Angel   19     57   167.64
8     9            Namara Racheal   19     55   154.94
9    10       Lwamulungi Sheillah   22     78   162.56
10   11           Nakawuka Sandra   25     60   175.26
11   12   Achola Gloria Fortunate   27     80   172.72
12   13             Nagawa Esther   21     58   188.42
13   14           wanjiku hananny   19     50    165.1
14   15            babirye Sandra   21     50   175.26
15   16          nakagga shanitah   21     50   175.26
16   17    Wembabazi Vivian Ritah   20     49   160.02
17   18   Nanziri Ritah Namayanja   23     70   162.56
18   19            Nasejje Mariam   20     62    101.6
19   20  Namukose Jolline Edriana   20     55   162.56
20   21      Agatha Faith Anyango   27     55    93.98
21   22              Kirabo Sarah   23     60    165.1
22   23          Nansalire Anitah   21     45     63.5
23   34             Nalugo gladys   19     70    101.6
24   25            Namakula Allen   20     55   170.18
25   26           Tukahirwa emily   22     67   175.26
26   27            Shamirah Ahmed   21     67   137.16
27   28          Ameso lmmaculate   23     64    165.1
28   29                Ayoo Teddy   20     50   157.48
29   30                Biira Mary   30     65   104.14
30   31        Aloyo Brenda Ojera   23     52   170.18
31   32        Ayebale Immaculate   24     50   162.56

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.tail()

    S/N       student_names  age weight   height
27   28    Ameso lmmaculate   23     64    165.1
28   29          Ayoo Teddy   20     50   157.48
29   30          Biira Mary   30     65   104.14
30   31  Aloyo Brenda Ojera   23     52   170.18
31   32  Ayebale Immaculate   24     50   162.56

In [7]:
df.head()

   S/N             student_names  age weight   height
0    1            Adokorac Nancy   20     74    177.8
1    2   Amutuhaire Faith Ahabwe   27     47   157.48
2    3     KWAGALA JOANNA VICTOR   21     54   185.42
3    4              mahoro cathy   23     30   185.42
4    5  Mbabazi Hawa Bint Edrisa   19     59   175.26

In [8]:
# Calculating Mean
MeanAge = df['age'].mean()
print(MeanAge)

22.03125

In [9]:
# Standard deviation
std_age = df['age'].std()
print(std_age)

2.7648061823220904

In [11]:
# Variance
var_age = df['age'].var()
print(var_age)

7.644153225806452

In [16]:
#Weight
df = df[pd.to_numeric(df['weight'],errors='coerce').notna()]

In [17]:
#  Mean Weight
mean_weight = df['weight'].mean()
print(mean_weight)

60.607142857142854

In [18]:
#Standard Deviation for Weight
std_weight = df['weight'].std()
print(std_weight)

8.949815995270871

In [19]:
# Variance for weight
var_weight = df['weight'].var()
print(var_weight)

80.09920634920634

In [20]:
# Calculating mean height
df['height']=pd.to_numeric(df['height'],errors='coerce')
mean_height=df['height'].mean()
print(mean_height)

166.37

In [21]:
# Standard deviation for height
std_height = df['height'].std()
print(std_height)

5.388153672641495

In [22]:
# Variance for height
var_height = df['height'].var()
print(var_height)

29.032200000000035